##### 연산
    행/열 인덱스를 기준으로 모든 원소를 정렬한다
    동일한 위치에 있는 원소끼리 일대일 대응시킨다
    일대일 대응이 되는 원소끼리 연산을 처리한다

In [1]:
import pandas as pd
St1 = pd.Series({'국어':100,'영어':90,'수학':80})
St2 = pd.Series({'국어':90,'영어':80,'수학':80})
print(St1)
print(St2)

국어    100
영어     90
수학     80
dtype: int64
국어    90
영어    80
수학    80
dtype: int64

Series 간 연산

In [2]:
add = St1 + St2
sub = St1 - St2
mul = St1 * St2
div = round((St1 / St2),2)
print(add)

국어    190
영어    170
수학    160
dtype: int64

In [3]:
df = pd.concat([add,sub,mul,div],axis = 1)
df_rn = df.rename(columns={0:'Sum',1:'Sub',2:'Mul',3:'Div'})
df_rn

    Sum  Sub   Mul   Div
국어  190   10  9000  1.11
영어  170   10  7200  1.12
수학  160    0  6400  1.00

In [5]:
df.columns = ['Add','Sub','Mul','Div']
df

    Add  Sub   Mul   Div
국어  190   10  9000  1.11
영어  170   10  7200  1.12
수학  160    0  6400  1.00

In [9]:
import numpy as np
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [16]:
a= np.arange(12)
print(a)
b = a.reshape(2,2,3)
c = b.reshape(4,3)
c

[ 0  1  2  3  4  5  6  7  8  9 10 11]

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [18]:
import numpy as np
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [20]:
import numpy as np
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [22]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [30]:
add_data = df1.add(df2,fill_value=0)
add_data

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [31]:
sub_data = df1.sub(df2,fill_value=0)
sub_data

      a     b     c     d     e
0   0.0   0.0   0.0   0.0  -4.0
1  -1.0  -1.0  -1.0  -1.0  -9.0
2  -2.0  -2.0  -2.0  -2.0 -14.0
3 -15.0 -16.0 -17.0 -18.0 -19.0

In [35]:
mul_data = df1.mul(df2,fill_value=1)
mul_data

      a     b      c      d     e
0   0.0   1.0    4.0    9.0   4.0
1  20.0  30.0   42.0   56.0   9.0
2  80.0  99.0  120.0  143.0  14.0
3  15.0  16.0   17.0   18.0  19.0

In [34]:
div_data = df1.div(df2,fill_value=1)
div_data

          a         b         c         d         e
0       NaN  1.000000  1.000000  1.000000  0.250000
1  0.800000  0.833333  0.857143  0.875000  0.111111
2  0.800000  0.818182  0.833333  0.846154  0.071429
3  0.066667  0.062500  0.058824  0.055556  0.052632

In [43]:
1/df1 
# == df1.rdiv(1)
#프로그램짤때 이렇게 나오면 골치터짐
#필요에 따라서 처리를 해줘야 머리 안터짐
#예외처리나 조건문으로 이런거 안나오게 해야됨 이거 지지임 지지

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [50]:
#df1
S1 = df1.iloc[0]
S1

a    0.0
b    1.0
c    2.0
d    3.0
Name: 0, dtype: float64

In [51]:
df1 -  S1

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  4.0  4.0  4.0  4.0
2  8.0  8.0  8.0  8.0

In [53]:
s2 = df1['d']
s2
df1.sub(s2,axis=0)

     a    b    c    d
0 -3.0 -2.0 -1.0  0.0
1 -3.0 -2.0 -1.0  0.0
2 -3.0 -2.0 -1.0  0.0

Q.DF df1,df2를 생성하고 첫째 행을 r1r2에 첫번째열을 c1c2에 저장한 후 계산하셈

In [73]:
import numpy as np
df_1= pd.DataFrame(np.arange(25.).reshape((5,5)),columns=list('abcde'))
df_2= pd.DataFrame(np.arange(30.).reshape((5,6)),columns=list('abcdef'))

In [77]:
r1 = df_1.iloc[0]
r2 = df_2.iloc[0]
c1 = df_1['a']
c2 = df_2['a']

In [78]:
df_ADD = df_1 + df_2

In [ ]:
df_sub = df_1.